Tekla.Structures.Analysis.AnalysisResult.ObjectTypeEnum
The object type.

Tekla.Structures.Analysis.AnalysisResult.ObjectTypeEnum.OBJECT_TYPE_MODEL
The model object type.

Tekla.Structures.Analysis.AnalysisResult.ObjectTypeEnum.OBJECT_TYPE_MEMBER
The analytical member object type.

Tekla.Structures.Analysis.AnalysisResult.ObjectTypeEnum.OBJECT_TYPE_NODE
The node object type.

Tekla.Structures.Analysis.AnalysisResult.ObjectTypeEnum.OBJECT_TYPE_PART
The physical member object type.

Tekla.Structures.Analysis.AnalysisResult.ObjectTypeEnum.OBJECT_TYPE_AREA
The analytical area object type.